Dlubal.RFEM5.ITendon
Interface for working with tendon

Dlubal.RFEM5.ITendon.GetData
Gets tendon basic parameters.
Returns: Tendon basic parameters.

Dlubal.RFEM5.ITendon.SetData(System.UInt32@)
Sets tendon basic parameters.
Tendon: Tendon basic parameters

Dlubal.RFEM5.ITendon.GetMaterial
Gets material parameters.
Returns: Material parameters.

Dlubal.RFEM5.ITendon.SetMaterial(System.UInt32@)
Sets material parameters.
Material: Material parameters

Dlubal.RFEM5.ITendon.GetGeometry
Gets array of 3D coordinates of tendon points.
Returns: Array of 3D coordinates of tendon points

Dlubal.RFEM5.ITendon.SetGeometry(System.UInt32@)
Sets array of 3D coordinates of tendon points.
Points: Array of 3D coordinates of tendon points

Dlubal.RFEM5.ITendon.GetSolverLoad
Gets array of solver load.
Returns: Array of solver load.

Dlubal.RFEM5.ITendon.SetSolverLoad(System.Double@)
Sets array of solver load.
SolverLoad: Array of solver load

Dlubal.RFEM5.ITendon.Delete
Deletes tendon.